Revit 2024 API
Alignment.IsValid Method
Overload List
Name | Description
IsValid()
 Checks if this object is a valid alignment.
IsValid(Element)
 Checks if the element is a valid alignment.
See Also
Alignment Class
Alignment Members
Autodesk.Revit.DB.Infrastructure Namespace